{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: expanding product data with multiple items per category, and adding an editorial category showcase section to the homepage.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their purpose and key implementation details for the Blockhaus e-commerce app.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH-based CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "Minimal HTML entry point for the Blockhaus React app, mounting the app at the root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with routes for home, products (with typed category search param), product detail, about, and contact pages wrapped in a shared Header/Footer layout.",
  "frontend/src/components/BestSellerSection.tsx": "Two-column section highlighting the best-seller product with its image on one side and product info, price, and a Shop Now CTA on a deep blue background.",
  "frontend/src/components/BrandStorySection.tsx": "Two-column editorial section pairing Bauhaus brand narrative text and an Our Story CTA button with a brand-story image and a tricolor geometric accent bar.",
  "frontend/src/components/CategoryShowcaseSection.tsx": "Full-width three-panel editorial showcase with tall background images, bold uppercase headlines, and outlined CTA buttons that navigate to filtered product pages for Mirrors, Rugs, and Pillows categories.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand logo, social media icons, navigation links, product category links, and a copyright notice with a dark Bauhaus-styled layout.",
  "frontend/src/components/Header.tsx": "Sticky site header with the BLOCKHAUS logo, desktop and mobile navigation links, and a shopping cart icon button.",
  "frontend/src/components/HeroSection.tsx": "Full-viewport hero section with a background image, overlay, large display headline, tagline, and CTA buttons linking to the products page and best-seller product.",
  "frontend/src/components/MarqueeStrip.tsx": "Horizontally scrolling marquee banner displaying repeated brand phrases with a configurable background color from a predefined palette.",
  "frontend/src/components/ProductGrid.tsx": "Homepage product preview grid showing four flagship products with images, hover overlays, names, and prices, linking to individual product pages.",
  "frontend/src/data/products.ts": "Defines the Product and ProductVariant TypeScript interfaces and exports a static array of all product listings including mirrors, rugs, and pillowcases with variants and details.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an Internet Computer actor (authenticated or anonymous) using the current identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module indicating no backend queries are needed, as all product data is served statically from the frontend.",
  "frontend/src/index.css": "Global stylesheet defining Bauhaus-inspired brand color tokens, Tailwind base/component/utility layers, custom fonts (Bebas Neue, Space Grotesk), and utility classes including a marquee animation.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AboutPage.tsx": "About page displaying the Blockhaus brand story with a hero section, a three-column craft/form/space grid, a brand story image with a blockquote, and a MarqueeStrip.",
  "frontend/src/pages/ContactPage.tsx": "Contact page with a dark header, contact info sidebar, and a form for name/email/subject/message that shows a confirmation state after submission.",
  "frontend/src/pages/Home.tsx": "Home page that composes the hero, marquee strips, best seller section, product grid, category showcase, and brand story sections into a single layout.",
  "frontend/src/pages/ProductDetail.tsx": "Product detail page that fetches a product by route param, displays its image, variants (size/color), quantity selector, and handles the not-found case with a back-navigation button.",
  "frontend/src/pages/ProductsPage.tsx": "Displays a filterable product listing page with category tabs and a responsive grid layout. Reads the active category from URL search params and navigates to individual product pages on click.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the Blockhaus frontend, defining custom brand colors (red, blue, orange, white), Bauhaus-style fonts (Bebas Neue, Space Grotesk), zero border-radius, custom box shadows, and marquee/accordion animations.",
  "project_state.json": "Tracks the overall project state for the Blockhaus luxury home brand site, including architecture notes, product catalog, required image assets, and a list of implemented features."
}